<a href="https://colab.research.google.com/github/GermanStanzione/TT-2C2025-Data-Analitycs-Notebooks/blob/main/Clase_3/Mia/An%C3%A1lisis%20Exploratorio%20de%20Datos%20con%20PandasMIO.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Intro a Análisis Exploratorio de Datos con Pandas usando un dataset de Netflix que bajé yo

In [ ]:
# Montar la unidad de drive
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
# Verificar que los archivos datasets se encuentren en la carpeta datasets
import os
os.listdir("/content/drive/MyDrive/datasets")

['users.csv',
 'hotels.csv',
 'reviews.csv',
 'Kaggle_users.gsheet',
 'netflix_titles.csv',
 'youtube_shorts_tiktok_trends_2025.csv',
 'satis_clientes.csv',
 'booking_db_nulls.sqlite',
 'booking_db.sqlite']

In [ ]:
# Importar la librería Pandas
import pandas as pd

In [ ]:
# Usar el método read_csv de Pandas (pd) que recibe como argumento el archivo csv y retorna un dataframe
df = pd.read_csv('/content/drive/MyDrive/datasets/netflix_titles.csv')

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [ ]:
df.dtypes

In [ ]:
df.describe()

In [ ]:
df.shape

In [ ]:
df.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [ ]:
df.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')

In [ ]:
df["country"].value_counts() #Puse "country" y devuelve la cuenta

country
United States                                                      2818
India                                                               972
United Kingdom                                                      419
Japan                                                               245
South Korea                                                         199
                                                                   ...
Mexico, United States, Spain, Colombia                                1
Canada, Norway                                                        1
Finland, Germany, Belgium                                             1
Argentina, United States, Mexico                                      1
United Kingdom, United States, Germany, Denmark, Belgium, Japan       1
Name: count, Length: 748, dtype: int64

Para encontrar los actores más frecuentes en la columna cast de tu DataFrame, debes seguir dos pasos clave: limpiar los datos y luego contarlos.

Paso 1: Limpiar y separar los datos
La columna cast contiene una cadena de texto con varios nombres de actores separados por comas. Para poder contar cada actor individualmente, primero necesitas separarlos.

El código a continuación te ayuda con este proceso:

* Reemplazar valores nulos: Los valores nulos en la columna cast deben ser reemplazados para evitar errores. Se usa una cadena vacía ('') para este propósito.

* Dividir la cadena: El método .str.split(', ') divide cada cadena de texto en una lista de actores, utilizando la coma seguida de un espacio como separador.

* Expandir las listas: El método .explode() toma cada lista de actores y crea una nueva fila para cada uno, manteniendo la información de la fila original. Esto es crucial para poder contar cada actor por separado.

In [ ]:
# Suponiendo que tu DataFrame se llama 'df'
df_limpio = df.assign(cast=df['cast'].fillna('').str.split(', ')).explode('cast')

# Eliminar espacios en blanco alrededor de los nombres de los actores
df_limpio['cast'] = df_limpio['cast'].str.strip()

# Eliminar las filas que ahora están vacías después de la limpieza
df_limpio = df_limpio[df_limpio['cast'] != '']

Paso 2: Contar y ordenar la frecuencia
Una vez que cada actor tiene su propia fila, puedes usar el método .value_counts() de Pandas, que es perfecto para este tipo de tarea.

* value_counts(): Cuenta las ocurrencias de cada valor único en una columna y devuelve una Serie ordenada en orden descendente.

In [ ]:
# Contar la frecuencia de cada actor y mostrar los 10 más frecuentes
actores_frecuentes = df_limpio['cast'].value_counts().head(10)
print(actores_frecuentes)

cast
Anupam Kher         43
Shah Rukh Khan      35
Julie Tejwani       33
Takahiro Sakurai    32
Naseeruddin Shah    32
Rupa Bhimani        31
Om Puri             30
Akshay Kumar        30
Yuki Kaji           29
Amitabh Bachchan    28
Name: count, dtype: int64

In [ ]:
df.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [ ]:
# 1. Filtrar el DataFrame para un país específico
# Reemplaza 'España' con el país que te interese
df_pais = df[df['country'] == 'United States'].copy()

# 2. Limpiar y separar los actores de la columna 'cast'
# Usamos .copy() para evitar un SettingWithCopyWarning
df_limpio_pais = df_pais.assign(cast=df_pais['cast'].fillna('').str.split(', ')).explode('cast')

# Eliminar espacios y filas vacías
df_limpio_pais['cast'] = df_limpio_pais['cast'].str.strip()
df_limpio_pais = df_limpio_pais[df_limpio_pais['cast'] != '']

# 3. Contar la frecuencia y mostrar los 10 más comunes
actores_por_pais = df_limpio_pais['cast'].value_counts().head(10)

print(f"Los 10 actores más frecuentes en NETFLIX en USA son:\n{actores_por_pais}")

Los 10 actores más frecuentes en NETFLIX en USA son:
cast
Adam Sandler         20
Samuel L. Jackson    19
Fred Tatasciore      17
Molly Shannon        15
Seth Rogen           15
Erin Fitzgerald      14
Laura Bailey         14
Chris Rock           14
Nicolas Cage         14
Morgan Freeman       14
Name: count, dtype: int64

In [ ]:
df_pais.head()

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt
plt.figure(figsize=(6,4))
sns.countplot(x='Pclass', data=df, palette='Set1')
plt.title("Distribucion de la clase")
plt.xlabel("Clase")
plt.ylabel("Cantidad")
plt.show()

In [ ]:
# Liberar la unidad
drive.flush_and_unmount()